chat_system_29819075_actor_description=Torn Digor. Dwarves' king.
chat_system_29819075_switch_1_header_1=^?^So, [player], do you have any news about my son?
chat_system_29819075_snap_0_question=^?^So, who comes to us? A human?!!<br>What is a human doing in the heart of Kordar, while we are at war with humans?
chat_system_29819075_snap_0_answer_0=^?^Good day, Your Majesty. My name is [player], I'm an ambassador from King Mark...
chat_system_29819075_snap_7_question=^?^Ambassador? Could King Mark have decided to discuss the terms of his surrender?
chat_system_29819075_snap_7_answer_0=^?^I've brought a peace treaty, which my king wants to conclude with Kordar... On behalf of His Majesty I apologize for everything that has happened, and promise that Darion will compensate...
chat_system_29819075_snap_8_question=^?^Compensate? Human! How can you compensate the tears of those mothers who will never see their sons again? Human cruelty has no borders! Kordar is now fighting with an army of demons who have invaded our world, and your king cruelly stabs us in the back!<br>Why did your king take away the mines from us, and kill our people? Why did he start the war only now to ask for peace? Answer, human!
chat_system_29819075_snap_8_answer_0=^?^King Mark is not guilty. There was a conspiracy in Darion, the purpose of which was the ownership of the Creiston Mines... (tell about Ahey's conspiracy...)
chat_system_29819075_snap_1_question=^?^Hm... I knew humans were guileful and sly, but I didn't think that the shine of gold could obscure your mind so much... And they say that dwarves lose their will before gold!<br>Ok, give me the papers...<br>[s]Torn Digor takes the treaty and looks through it. He hums to himself, and looks at you:[/s]<br>Well! It seems that King Mark really does want peace. Ok, I agree, but I myself have terms as well... I hope you have the authority to settle a couple of questions?
chat_system_29819075_snap_1_answer_0=^?^Yes, I have authority in this matter.
chat_system_29819075_snap_2_question=^?^First, the gold discovered by Ahey will be mined by the dwarves.<br>Second, Darion will provide assistance in our war with the demons.<br>Third, the food and wood which we have bought from Darion in the past, are now needed in double amount!
chat_system_29819075_snap_2_answer_0=^?^I believe our king will agree to these terms...
chat_system_29819075_snap_5_question=^?^I imagine so! He's not named "The Wise" for nothing... But there's one more condition!<br>We now need military aid more than ever. Our war with the demons exhausts Kordar. Hordes of bloodthirsty monsters continue to flow from the Portal, their resources seemingly limitless.<br>Recently, the demons managed to capture my son, Tibold. They've taken his castle Bogacho by storm. Go to the Taron Mines, [player], and deliver him his freedom. Then our treaty will be completed.
chat_system_29819075_snap_5_answer_0=^?^Ok, as a sign of good will, I will free your son and the castle!
chat_system_29819075_snap_5_answer_1=^?^Huh-huh. Take your pen and the treaty! I've knocked demons out of Bogacho. Crown Prince Tibold is free, and is restoring his castle.
chat_system_29819075_snap_9_question=^?^Now I see that King Mark is still a good judge of character, and he is served by the best of the best! I will certainly sign the agreement. I am grateful to you, [player], both as a king and as a father. I give you my personal hammer!<br>But I must warn you. My spies have informed me that there is a commotion in King Mark's castle. Something precious seems to be missing. I would not be surprised if this is another dreadful act by those damned guileful orcs!
chat_system_29819075_snap_9_answer_0=^?^A commotion in the castle? Something precious was missing?! I shall leave immediately!
chat_system_29819075_snap_3_question=^?^I'll help you to get home. In the name of the alliance between Kordar and Darion I will resume air communication between our countries!<br>Talk to our pilot, Lestag. He'll bring you to Mark's castle.
chat_system_29819075_snap_3_answer_0=^?^Thank you, Your Majesty!
chat_system_29819075_snap_6_question=^?^Good day, [player], do you have any news?
chat_system_29819075_snap_6_answer_0=^?^Yes I have, and very good news! I've managed to knock demons out of the castle and liberate your son.
chat_system_29819075_snap_6_answer_1=^?^I'm sorry, but I have to go, Your Majesty...
